import pandas as pd

print('----'*28)
print('Табель учащихся в школе № 28')

stud_card = {
        'ID': ['01','02','03','04','05'],
        'Имя' : ['Петр','Ирина','Максим','Олег','Дарья'],
        'Отчество' : ['Петрович','Алексеевна','Викторович','Леонидович','Сергеевна'],
        'Фамилия': ['Петров','Солнцева','Сизов','Антуров','Яснова'],
        'Дата рождения' : ['12.04.2008','23.12.2009','05.11.2009','16.09.2008','30.07.2008'],
        'Успеваемость' : ['Отличник','Хорошист','Отличник','Троечник','Хорошист']
}
    
sc = pd.DataFrame(data = stud_card)

with open('students.csv', 'a', encoding='UTF-8') as cl:
        cl.write(f'{sc}')
        cl.write('\n')
    
print(sc)